# file location: ${HOME}/Brewfile

# This file is used along with the `brew bundle` command to ensure that required packages and apps are installed.
# Also can be used to ensure that any package/apps that were installed as experimentation are uninstalled from the system.
# For a more detailed explanation of the philosophy/reasoning behind this file, please see https://openfolder.sh/macos-migrations-with-brewfile

# There are some common shell aliases that I have setup in the `${HOME}/.aliases` file for ease of running/typing (and also don't need to remember all those commands by-heart!). If you are using my `${HOME}/.aliases`, they will already be present for you.

# TODO: Need to find cask for:
#   Tinkertool
#   TypeWhisper (start on login)
#   ZoomHider

# set global preferences for all 'brew install' commands
cask_args appdir: '/Applications', fontdir: '/Library/Fonts', adopt: true

# java_present = system('/usr/libexec/java_home --failfast')
is_arm = ::Hardware::CPU.arm?
# is_beta_os = ::OS::Mac::full_version.unsupported_release?

# TODO: Hardcoding of the dotfiles repo folder - since that env var is not available inside this env
setup_login_items_script = "${HOME}/.config/dotfiles/scripts/setup-login-item.rb"

# These casks must come first -- required for manual login during a vanilla OS installation.
cask 'font-meslo-lg-nerd-font'
cask 'keybase',
  postinstall: "\"#{setup_login_items_script}\" -a 'Keybase' && " \
               "ln -sf '/Applications/Keybase.app/Contents/SharedSupport/bin/keybase' \"${HOMEBREW_PREFIX}/bin/keybase\" && " \
               "ln -sf '/Applications/Keybase.app/Contents/SharedSupport/bin/git-remote-keybase' \"${HOMEBREW_PREFIX}/bin/git-remote-keybase\""

# formulae pulled in from homebrew to replace system equivalents to fix any security issues since the OS was released
# This list is enhanced from https://macgnu.codewithshin.com/?id=gnu-programs-existing-in-macos-which-are-outdated
brew 'bash'
brew 'curl'
brew 'git'
brew 'grep'
brew 'less'
brew 'openssl'
brew 'rsync'
brew 'sqlite3'
brew 'vim'
brew 'wget'
brew 'zsh'

# formulae pulled in for base configs (if these are absent, you will get errors and things won't work)
brew 'antidote',
  postinstall: "[ -f '${HOME}/.aliases' ] && zsh -c 'source ${HOME}/.aliases && update_antidote_and_regenerate_plugin_bundle' || true"
brew 'delta'
brew 'direnv'
brew 'eza'
brew 'git-extras',
  postinstall: "rm -rf \"${HOMEBREW_REPOSITORY}/share/zsh/site-functions/_git\" 2>/dev/null || true"
brew 'git-tools'
brew 'git-trim'
brew 'mise'
brew 'starship'

# casks pulled in for base configs (if these are absent, you will get errors and things won't work)
cask 'iterm2'

# FIRST_INSTALL: While re-imaging the OS or setting up for the first time, install only the bare minimum apps/utilities above this line so that the rest of the backup restoration can proceed faster.

tap 'vorssaint/tap'
tap 'xykong/tap'

# formulae pulled in for advanced configs (these are optional, but still recommended)
brew 'bat'
brew 'btop'
brew 'git-gui'
brew 'jaq'
brew 'mole'
brew 'moreutils'
brew 'ncdu'
brew 'pandoc'
brew 'prettyping'
brew 'ripgrep'
brew 'shfmt'
brew 'syncthing'
brew 'tlrc'

cask 'clocker', postinstall: "\"#{setup_login_items_script}\" -a 'Clocker'"
cask 'dbeaver-community'
cask 'drawio'
cask 'firefox@nightly' #, greedy: true
cask 'flux-markdown', postinstall: 'qlmanage -r'
cask 'google-chrome@beta'
cask 'keepassxc@beta'
cask 'keycastr', postinstall: "\"#{setup_login_items_script}\" -a 'Keycastr'"
cask 'keyclu', postinstall: "\"#{setup_login_items_script}\" -a 'KeyClu'" if is_arm
cask 'mechvibes', postinstall: "\"#{setup_login_items_script}\" -a 'Mechvibes'"
cask 'onlyoffice'
cask 'protonvpn' # , postinstall: "\"#{setup_login_items_script}\" -a 'ProtonVPN'"
cask 'rancher' # if ::OS::Mac::version < 26
cask 'sol', postinstall: "\"#{setup_login_items_script}\" -a 'Sol'"
cask 'shortcat', postinstall: "\"#{setup_login_items_script}\" -a 'Shortcat'"
cask 'thaw', postinstall: "\"#{setup_login_items_script}\" -a 'Thaw'" if ::OS::Mac::version >= 14 && ::OS::Mac::version < 27
cask 'vorssaint', postinstall: "\"#{setup_login_items_script}\" -a 'Vorssaint'"
cask 'zed@preview',
  postinstall: "ln -sf '/Applications/Zed Preview.app/Contents/MacOS/cli' \"${HOMEBREW_PREFIX}/bin/zed\""
cask 'zen@twilight'
cask 'zoom'

# local AI coding tools
# tap 'jundot/omlx', 'git@github.com/jundot/omlx'
# reference: https://www.agileguy.ca/opencode-fully-local/
# to start ollama: ollama launch opencode --model gpt-oss-20b-MXFP4-Q8 -- $DOTFILES_DIR
brew 'ollama', link: true, restart_service: :changed
# brew 'omlx', restart_service: :changed if is_arm
brew 'opencode'

# These have been replaced with Vorssaint. Once I am fully satisfied, I will remove these references
# cask 'dockdoor', postinstall: "\"#{setup_login_items_script}\" -a 'Dockdoor'"
# cask 'stats', postinstall: "\"#{setup_login_items_script}\" -a 'Stats'"

# brew 'mas'
# mas 'PDFgear', id: 6469021132

# VSCode extensions
# Note: Retained as a reference in case of a future switch back to VSCode or VSCodium.
# To re-enable: uncomment the is_vscode_installed guard and the extension lines below.
# Note: brew silently installs VS Code when these lines are present but 'code' is not in PATH.
# is_vscode_installed = !`PATH="/opt/homebrew/bin:/usr/local/bin:${PATH}" which code`.chomp.empty?  # explicitly set PATH since the shell being opened doesn't run the login configs
# if is_vscode_installed
#   vscode 'britesnow.vscode-toggle-quotes'
#   vscode 'codezombiech.gitignore'
#   vscode 'davidanson.vscode-markdownlint'
#   vscode 'dbaeumer.vscode-eslint'
#   vscode 'digitalbrainstem.javascript-ejs-support'
#   vscode 'drcika.apc-extension'
#   vscode 'editorconfig.editorconfig'
#   vscode 'esbenp.prettier-vscode'
#   vscode 'genuitecllc.codetogether'
#   vscode 'github.vscode-github-actions'
#   vscode 'google.geminicodeassist'
#   vscode 'ibm.output-colorizer'
#   vscode 'mechatroner.rainbow-csv'
#   vscode 'mikestead.dotenv'
#   vscode 'mkhl.direnv'
#   vscode 'ms-azuretools.vscode-containers'
#   vscode 'ms-azuretools.vscode-docker'
#   vscode 'ms-vscode.atom-keybindings'
#   vscode 'ms-vscode.vscode-typescript-next'
#   vscode 'oderwat.indent-rainbow'
#   vscode 'orta.vscode-jest'
#   vscode 'redhat.vscode-yaml'
#   vscode 'richie5um2.vscode-sort-json'
#   vscode 'shan.code-settings-sync'
#   vscode 'shopify.ruby-lsp'
#   vscode 'tchayen.markdown-links'
#   vscode 'tyriar.sort-lines'
#   vscode 'vscode-icons-team.vscode-icons'
#   vscode 'wayou.vscode-todo-highlight'
#   vscode 'wmaurer.change-case'
#   vscode 'yzhang.markdown-all-in-one'
# end

# ----------------------------------------------------------------------------------------------------------
# Miscellaneous formulae and casks grouped separately to keep the main lists clean.

# --- encrypted backup in case keybase is shut down in the future
# tap 'Picocrypt/picocrypt' if is_arm
# cask 'picocrypt' if is_arm

# ---- zen-browser development
brew 'cairo'
brew 'gnu-tar'
brew 'mercurial'
# brew 'p7zip'
brew 'sccache'

# ---- docker utilities
# brew 'dive'   # docker layers inspection on steroids
# brew 'docker-diff'
# brew 'docker-slim'  # TODO: investigate if the http-probe is a deal-breaker
# brew 'hadolint'     # lint Dockerfiles (similar to shellcheck or shfmt for shell scripts)
# brew 'kubernetes-cli', link: true   # Note: Had to do this: rm /usr/local/bin/kubectl && brew link --overwrite kubernetes-cli
# brew 'kubernetes-helm'

# ---- git utilities
# brew 'git-crypt'

# ---- tmux utilities
# brew 'reattach-to-user-namespace' # Needed if using tmux (to be able to access the macos clipboard from within tmux)
# brew 'tmux'

# ---- general utilities
# brew 'container', restart_service: :changed if ::OS::Mac::version >= 26
# brew 'dua-cli'
# brew 'fzy'
# brew 'gradle-completion'
# brew 'gs'   # used for compressing PDFs
# brew 'libressl', link: true
# brew 'localstack'
# brew 'shellcheck' # Not using since this only supports bash
# brew 'speedtest-cli'
# brew 'watch'
# brew 'wifi-password'

# ---- casks
# tap 'TheBoredTeam/boring-notch'
# cask 'boring-notch', postinstall: "\"#{setup_login_items_script}\" -a 'boringNotch'" if ::OS::Mac::version >= 14
# cask 'brave-browser'
# cask 'claude-code'
# cask 'cloudflare-warp'
# cask 'codeql'
# cask 'fliqlo'
# cask 'floorp' # Doesn't have keyboard shortcuts to switch across workspaces
# cask 'ghostty@tip' # Not using since it doesn't have many features (like broadcasting keystrokes to panels; using iTerm instead)
# cask 'git-credential-manager'   # https://docs.github.com/en/get-started/getting-started-with-git/caching-your-github-credentials-in-git
# cask 'grayjay'
# cask 'intellij-idea-ce'
# cask 'kdiff3'
# cask 'knockknock'   # app to find persistently installed softwares/services/malwares
# cask 'licecap'
# cask 'lulu'
cask 'windows-app'    # replacement for microsoft-remote-desktop
# cask 'microsoft-teams'
# cask 'monolingual'
# cask 'netspot'
# cask 'ngrok'
# cask 'notunes'
# cask 'onyx' # if !is_beta_os && ::OS::Mac::version < 26
# cask 'silicon' if is_arm
# cask 'tempbox'
# cask 'the-unarchiver'
# cask 'thunderbird@daily'
# cask 'tor-browser@alpha'
# cask 'utm'
# cask 'visual-studio-code'
